bookmarks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MinasMazar's blog</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">MinasMazar's blog</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0ac2136">How to set environment variables from .env file&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dev">dev</span></span></a></li>
<li><a href="#org3d05aa9">Development environment for Elixir + Phoenix with Docker and Docker-compose</a></li>
<li><a href="#org39d1cdc">Adolfo Villafiorita's bookmarks&#xa0;&#xa0;&#xa0;<span class="tag"><span class="blog">blog</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="bookmarks">bookmarks</span></span></a></li>
<li><a href="#org1dea157">https://saptaks.website/&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cool">cool</span>&#xa0;<span class="website">website</span></span></a></li>
<li><a href="#org25d2b68">https://a11y-webring.club/&#xa0;&#xa0;&#xa0;<span class="tag"><span class="webring">webring</span>&#xa0;<span class="nerd">nerd</span>&#xa0;<span class="technology">technology</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-org0ac2136" class="outline-2">
<h2 id="org0ac2136">How to set environment variables from .env file&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dev">dev</span></span></h2>
<div class="outline-text-2" id="text-org0ac2136">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d0b9f0; font-weight: bold;">set</span> -a <span style="color: #cac89f; font-style: italic;"># </span><span style="color: #cac89f; font-style: italic;">automatically export all variables</span>
<span style="color: #d0b9f0; font-weight: bold;">source</span> .env
<span style="color: #d0b9f0; font-weight: bold;">set</span> +a
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d05aa9" class="outline-2">
<h2 id="org3d05aa9"><a href="https://dev.to/hlappa/development-environment-for-elixir-phoenix-with-docker-and-docker-compose-2g17">Development environment for Elixir + Phoenix with Docker and Docker-compose</a></h2>
</div>
<div id="outline-container-org39d1cdc" class="outline-2">
<h2 id="org39d1cdc"><a href="https://ict4g.net/adolfo/index.html">Adolfo Villafiorita's bookmarks</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="blog">blog</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="bookmarks">bookmarks</span></span></h2>
</div>
<div id="outline-container-org1dea157" class="outline-2">
<h2 id="org1dea157"><a href="https://saptaks.website/">https://saptaks.website/</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cool">cool</span>&#xa0;<span class="website">website</span></span></h2>
</div>
<div id="outline-container-org25d2b68" class="outline-2">
<h2 id="org25d2b68"><a href="https://a11y-webring.club/">https://a11y-webring.club/</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="webring">webring</span>&#xa0;<span class="nerd">nerd</span>&#xa0;<span class="technology">technology</span></span></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-17 Wed 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
